org/20220425082546-rekindle_democracy.org
:PROPERTIES:
:ID:       d4e7c4bf-d67e-46eb-b721-fab3254b8b86
:END:
#+TITLE: Rekindle democracy
#+CREATED: [2022-04-25 Mon 08:25]
#+LAST_MODIFIED: [2022-04-25 Mon 08:40]

- tags :: [[id:bf925a86-18be-4845-ad88-063a28f359f4][Democracy]]

It is somewhat problematic that the french president can be elected with less than 20% support. Something needs to change. But I don't think that with participation levels below 60% you can so easily get people interested in the dmeocratic process.

Maybe you start at the local level, and allow people to make decisions in the areas where they see the direct results of their participation.

* TODO Is there a correlation between towns where Town Hall meetings exist and turnout at national elections?
[[https://sos.vermont.gov/elections/election-info-resources/town-meeting-local-elections/][This Vermont website]] has turnout statistics on town meetings.

* Reference

- Frank M. Bryan. Real democracy: The New England town meeting and how it works.
