20220425082546-rekindle_democracy.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-01-07 Sun 20:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Rekindle democracy</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Rekindle democracy</h1>
<dl class="org-dl">
<dt>tags</dt><dd><a href="20220306175155-democracy.html#ID-bf925a86-18be-4845-ad88-063a28f359f4">Democracy</a></dd>
</dl>

<p>
It is somewhat problematic that the french president can be elected with less than 20% support. Something needs to change. But I don't think that with participation levels below 60% you can so easily get people interested in the dmeocratic process.
</p>

<p>
Maybe you start at the local level, and allow people to make decisions in the areas where they see the direct results of their participation.
</p>

<div id="outline-container-orgbd760e2" class="outline-2">
<h2 id="orgbd760e2"><span class="todo TODO">TODO</span> Is there a correlation between towns where Town Hall meetings exist and turnout at national elections?</h2>
<div class="outline-text-2" id="text-orgbd760e2">
<p>
<a target='_blank' rel='noopener noreferrer' class='external' href="https://sos.vermont.gov/elections/election-info-resources/town-meeting-local-elections/">This Vermont website</a> has turnout statistics on town meetings.
</p>
</div>
</div>

<div id="outline-container-org2ac82e9" class="outline-2">
<h2 id="org2ac82e9">Reference</h2>
<div class="outline-text-2" id="text-org2ac82e9">
<ul class="org-ul">
<li>Frank M. Bryan. Real democracy: The New England town meeting and how it works.</li>
</ul>
</div>
</div>

<div id="outline-container-orgab55fb0" class="outline-2">
<h2 id="orgab55fb0">Links to this note</h2>
</div>
</div>
</body>
</html>
